app/controllers/entries_controller.rb

  def index
    if logged_in?
      @entries = Entry.all
---
SELECT "entries".* FROM "entries"  ORDER BY created_at DESC