app/controllers/feeds_controller.rb

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."url" = $1 AND "feeds"."user_id" = $2 LIMIT 1  [["url", "http://rss.uol.com.br/feed/noticias.xml"], ["user_id", 1]]
INSERT INTO "feeds" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Uol"], ["url", "http://rss.uol.com.br/feed/noticias.xml"], ["user_id", 1], ["created_at", "2015-07-22 14:18:42.235308"], ["updated_at", "2015-07-22 14:18:42.235308"]]
UPDATE "feeds" SET "status" = $1, "updated_at" = $2 WHERE "feeds"."id" = $3  [["status", "Fetched (ring) 200 762 and parsed 0/40 entries"], ["updated_at", "2015-07-15 12:53:05.767047"], ["id", 1]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 14]]
---
  def create
    @feed = Feed.new(feed_params)

    existeFeed = Feed.find_by(url: @feed.url, user_id: @feed.user_id )

    if existeFeed.nil?
      if @feed.save
        body, ok = SuperfeedrEngine::Engine.subscribe(@feed, {:retrieve => true})
        if !ok
          redirect_to @feed, notice: "Feed cadastrado com sucesso, mas nao carregado. #{body}"
        else
          if body
            @feed.notified JSON.parse(body)
          end
          redirect_to @feed, notice: 'Feed cadastrado e carregado com sucesso!'
        end
      else
        render :new
      end
    else
      redirect_to '/feeds/new', notice: 'Feed ja cadastrado para este usuario!'
    end

  rescue => e
    @feed.destroy

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."url" = $1 AND "feeds"."user_id" = $2 LIMIT 1  [["url", "http://tecnologia.uol.scom.br/ultnot/index.xml"], ["user_id", 1]]
UPDATE "feeds" SET "title" = $1, "url" = $2, "updated_at" = $3 WHERE "feeds"."id" = $4  [["title", "Uol Economia"], ["url", "http://rss.uol.com.br/feed/economia.xml"], ["updated_at", "2015-07-22 14:29:24.040324"], ["id", 6]]
---
    def update

    id = @feed.id
    existeFeed = Feed.find_by(url: :url, user_id: :user_id )

    if existeFeed.nil?
      if @feed.update(feed_params)

DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 6]]
---
  def destroy
    body, ok =  SuperfeedrEngine::Engine.unsubscribe(@feed)
    if !ok
      redirect_to @feed, notice: body
    else
      @feed.destroy

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", nil]]
---
    def set_feed
      @feed = Feed.find(params[:id])