app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT 1  [["email", "marcelocicco@gmail.com"], ["password", "1234"]]
---
  def create

    user = User.find_by(email: params[:session][:email].downcase, password: params[:session][:password])