app/controllers/users_controller.rb

  def create


    @user = User.new(user_params)

    if @user.name.delete(' ') == '' or @user.password.delete(' ') == '' or @user.email.delete(' ') == ''
        redirect_to '/signup', notice: 'Favor preencher todos os campos!'
    else
      existeUser = User.find_by_email(@user.email)

      if existeUser.nil?
          if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "marcelocicco@gmail.com"]]
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Marcelo"], ["email", "marcelocicco@gmail.com"], ["password", "1234"], ["created_at", "2015-07-22 11:59:47.532542"], ["updated_at", "2015-07-22 11:59:47.532542"]]